<a href="https://colab.research.google.com/github/sush2004/Python/blob/main/Python_for_Sqlite3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import sqlite3
from datetime import date

In [2]:
db = sqlite3.connect("dr_testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text, Mobile text,Mail text)")
except:
  print("Table Already existed !!")

In [3]:
db = sqlite3.connect("dr_testing.db")

In [4]:

#Date = date.today().strftime("%d-%m-%Y")
Name = "Darren Redmond"
Mobile = "9000011101"
Mail = "darren.redmond@gmail.com"

In [5]:
cmd = "insert into results(Name, Mobile,Mail) values('{}','{}','{}')".format(Name,Mobile,Mail)
db.execute(cmd)
db.commit()

In [6]:
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('Darren Redmond', '9000011101', 'darren.redmond@gmail.com')

In [7]:
qry = 'SELECT * FROM results'
df = pd.read_sql_query(qry, db)
df.head()

             Name      Mobile                      Mail
0  Darren Redmond  9000011101  darren.redmond@gmail.com

In [8]:
def pushtoDB(Name,Mobile,Mail):
#inserting values inside the created table
    db = sqlite3.connect("dr_testing.db")    
    cmd = "insert into results(Name, Mobile,Mail) values('{}','{}','{}')".format(Name,Mobile,Mail)
    db.execute(cmd)
    db.commit()

In [9]:
pushtoDB("Testttt","121","2112")

In [10]:
db = sqlite3.connect("dr_testing.db")
qry = "SELECT * FROM results"
df = pd.read_sql_query(qry, db)
df.head()

             Name      Mobile                      Mail
0  Darren Redmond  9000011101  darren.redmond@gmail.com
1         Testttt         121                      2112

In [13]:
Name = input("Which user would you like to update")
Mobile = input("new number")
#cmd = "update results set mobile = '{}' where name like '{}%'".format(Mobile,Name)
#patter update
cmd = "update results set mobile = '{}' where name like '%{}%'".format(Mobile,Name)
db.execute(cmd)
db.commit()

Which user would you like to updateDarren Redmond
new number8888888

In [16]:
df = pd.read_sql_query(qry, db)
df.head()

             Name Mobile                      Mail
0  Darren Redmond      1  darren.redmond@gmail.com
1         Testttt      1                      2112

In [15]:
Name = input("Which user would you like to update")
Mobile = input("new number")
cmd = "update results set mobile = '{}' or name = '{}'".format(Mobile,Name)
#patter update
#cmd = "update results set mobile = '{}' where name like '%{}%'".format(Mobile,Name)
db.execute(cmd)
db.commit()

Which user would you like to updateDarren Redmond
new number777777777

In [17]:
Name = input("Which user would you like to update")
Mobile = input("new number")
cmd = "delete from results where mobile = '{}' or name = '{}'".format(Mobile,Name)
#patter update
#cmd = "update results set mobile = '{}' where name like '%{}%'".format(Mobile,Name)
db.execute(cmd)
db.commit()

Which user would you like to updateTesttttt
new number5555555

In [18]:
df = pd.read_sql_query(qry, db)
df.head()

             Name Mobile                      Mail
0  Darren Redmond      1  darren.redmond@gmail.com
1         Testttt      1                      2112

In [20]:
for i in range(0,len(data)):
  pushtoDB(data,iloc[i][0],data.iloc[i][1],data,iloc[i][2])

NameError: ignored

In [40]:
data = pd.read_csv("dummy.csv")
data.head()
data.shape

(1128, 3)

In [41]:
qry = 'SELECT * FROM results'
df = pd.read_sql_query(qry, db)
df.head()

             Name      Mobile                      Mail
0  Darren Redmond           1  darren.redmond@gmail.com
1         Testttt           1                      2112
2           Test1  9000000000     testermail1@gmail.com
3           Test2  9000000001     testermail2@gmail.com
4           Test3  9000000002     testermail3@gmail.com

In [37]:
for i in range(0,len(data)):
  pushtoDB(data.iloc[i][0],data.iloc[i][1],data.iloc[i][2])

In [38]:
df

      Name Mobile  Mail
0  Testttt      1  2112

In [39]:
len(df)

1

In [42]:
df

                Name      Mobile                      Mail
0     Darren Redmond           1  darren.redmond@gmail.com
1            Testttt           1                      2112
2              Test1  9000000000     testermail1@gmail.com
3              Test2  9000000001     testermail2@gmail.com
4              Test3  9000000002     testermail3@gmail.com
...              ...         ...                       ...
1125        Test1124  9000001123  testermail1124@gmail.com
1126        Test1125  9000001124  testermail1125@gmail.com
1127        Test1126  9000001125  testermail1126@gmail.com
1128        Test1127  9000001126  testermail1127@gmail.com
1129        Test1128  9000001127  testermail1128@gmail.com

[1130 rows x 3 columns]

In [43]:
len(df)

1130